---
type: Water
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 7
tags: [revit-api, class]
---

# Water

`Autodesk.Revit.DB.Visual.Water` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CommonTintColor | 2018.1 | `public static string CommonTintColor { get ; }` |
| Property | CommonTintToggle | 2018.1 | `public static string CommonTintToggle { get ; }` |
| Property | WaterBumpAmount | 2018.1 | `public static string WaterBumpAmount { get ; }` |
| Property | WaterColorByObject | 2018.1 | `public static string WaterColorByObject { get ; }` |
| Property | WaterTintColor | 2018.1 | `public static string WaterTintColor { get ; }` |
| Property | WaterTintEnable | 2018.1 | `public static string WaterTintEnable { get ; }` |
| Property | WaterType | 2018.1 | `public static string WaterType { get ; }` |